MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1574/mcu.h
extern volatile PWM1INTFbits_t PWM1INTFbits __at(0xD9D);
// bitfield macros
#define _PWM1INTF_PRIF_POSN                                 0x0
#define _PWM1INTF_PRIF_POSITION                             0x0
#define _PWM1INTF_PRIF_SIZE                                 0x1
#define _PWM1INTF_PRIF_LENGTH                               0x1
#define _PWM1INTF_PRIF_MASK                                 0x1
#define _PWM1INTF_DCIF_POSN                                 0x1
#define _PWM1INTF_DCIF_POSITION                             0x1
#define _PWM1INTF_DCIF_SIZE                                 0x1
#define _PWM1INTF_DCIF_LENGTH                               0x1
#define _PWM1INTF_DCIF_MASK                                 0x2
#define _PWM1INTF_PHIF_POSN                                 0x2
#define _PWM1INTF_PHIF_POSITION                             0x2
#define _PWM1INTF_PHIF_SIZE                                 0x1
#define _PWM1INTF_PHIF_LENGTH                               0x1
#define _PWM1INTF_PHIF_MASK                                 0x4
#define _PWM1INTF_OFIF_POSN                                 0x3
#define _PWM1INTF_OFIF_POSITION                             0x3
#define _PWM1INTF_OFIF_SIZE                                 0x1
#define _PWM1INTF_OFIF_LENGTH                               0x1
#define _PWM1INTF_OFIF_MASK                                 0x8
#define _PWM1INTF_PWM1PRIF_POSN                             0x0
#define _PWM1INTF_PWM1PRIF_POSITION                         0x0
#define _PWM1INTF_PWM1PRIF_SIZE                             0x1
#define _PWM1INTF_PWM1PRIF_LENGTH                           0x1
#define _PWM1INTF_PWM1PRIF_MASK                             0x1
#define _PWM1INTF_PWM1DCIF_POSN                             0x1
#define _PWM1INTF_PWM1DCIF_POSITION                         0x1
#define _PWM1INTF_PWM1DCIF_SIZE                             0x1
#define _PWM1INTF_PWM1DCIF_LENGTH                           0x1
#define _PWM1INTF_PWM1DCIF_MASK                             0x2
#define _PWM1INTF_PWM1PHIF_POSN                             0x2
#define _PWM1INTF_PWM1PHIF_POSITION                         0x2
#define _PWM1INTF_PWM1PHIF_SIZE                             0x1
#define _PWM1INTF_PWM1PHIF_LENGTH                           0x1
#define _PWM1INTF_PWM1PHIF_MASK                             0x4
#define _PWM1INTF_PWM1OFIF_POSN                             0x3
#define _PWM1INTF_PWM1OFIF_POSITION                         0x3
#define _PWM1INTF_PWM1OFIF_SIZE                             0x1
#define _PWM1INTF_PWM1OFIF_LENGTH                           0x1
#define _PWM1INTF_PWM1OFIF_MASK                             0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM1PRIF               :1;
        unsigned PWM1DCIF               :1;
        unsigned PWM1PHIF               :1;
        unsigned PWM1OFIF               :1;
    };
} PWM1INTFLGbits_t;
extern volatile PWM1INTFLGbits_t PWM1INTFLGbits __at(0xD9D);
// bitfield macros
#define _PWM1INTFLG_PRIF_POSN                               0x0
#define _PWM1INTFLG_PRIF_POSITION                           0x0
#define _PWM1INTFLG_PRIF_SIZE                               0x1
#define _PWM1INTFLG_PRIF_LENGTH                             0x1
#define _PWM1INTFLG_PRIF_MASK                               0x1
#define _PWM1INTFLG_DCIF_POSN                               0x1
#define _PWM1INTFLG_DCIF_POSITION                           0x1
#define _PWM1INTFLG_DCIF_SIZE                               0x1
#define _PWM1INTFLG_DCIF_LENGTH                             0x1
#define _PWM1INTFLG_DCIF_MASK                               0x2
#define _PWM1INTFLG_PHIF_POSN                               0x2
#define _PWM1INTFLG_PHIF_POSITION                           0x2
#define _PWM1INTFLG_PHIF_SIZE                               0x1
#define _PWM1INTFLG_PHIF_LENGTH                             0x1
#define _PWM1INTFLG_PHIF_MASK                               0x4
#define _PWM1INTFLG_OFIF_POSN                               0x3
#define _PWM1INTFLG_OFIF_POSITION                           0x3
#define _PWM1INTFLG_OFIF_SIZE                               0x1
#define _PWM1INTFLG_OFIF_LENGTH                             0x1
#define _PWM1INTFLG_OFIF_MASK                               0x8
#define _PWM1INTFLG_PWM1PRIF_POSN                           0x0
#define _PWM1INTFLG_PWM1PRIF_POSITION                       0x0
#define _PWM1INTFLG_PWM1PRIF_SIZE                           0x1
#define _PWM1INTFLG_PWM1PRIF_LENGTH                         0x1
#define _PWM1INTFLG_PWM1PRIF_MASK                           0x1
#define _PWM1INTFLG_PWM1DCIF_POSN                           0x1
#define _PWM1INTFLG_PWM1DCIF_POSITION                       0x1
#define _PWM1INTFLG_PWM1DCIF_SIZE                           0x1
#define _PWM1INTFLG_PWM1DCIF_LENGTH                         0x1
#define _PWM1INTFLG_PWM1DCIF_MASK                           0x2
#define _PWM1INTFLG_PWM1PHIF_POSN                           0x2
#define _PWM1INTFLG_PWM1PHIF_POSITION                       0x2
#define _PWM1INTFLG_PWM1PHIF_SIZE                           0x1
#define _PWM1INTFLG_PWM1PHIF_LENGTH                         0x1
#define _PWM1INTFLG_PWM1PHIF_MASK                           0x4
#define _PWM1INTFLG_PWM1OFIF_POSN                           0x3
#define _PWM1INTFLG_PWM1OFIF_POSITION                       0x3
#define _PWM1INTFLG_PWM1OFIF_SIZE                           0x1
#define _PWM1INTFLG_PWM1OFIF_LENGTH                         0x1
#define _PWM1INTFLG_PWM1OFIF_MASK                           0x8

// Register: PWM1CLKCON
#define PWM1CLKCON PWM1CLKCON
extern volatile unsigned char           PWM1CLKCON          __at(0xD9E);
#ifndef _LIB_BUILD
asm("PWM1CLKCON equ 0D9Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :2;
        unsigned                        :2;
        unsigned PS                     :3;
    };
    struct {
        unsigned PWM1CS0                :1;
        unsigned PWM1CS1                :1;
        unsigned                        :2;
        unsigned PWM1PS0                :1;
        unsigned PWM1PS1                :1;
        unsigned PWM1PS2                :1;
    };
    struct {
        unsigned PWM1CS                 :3;
        unsigned                        :1;
        unsigned PWM1PS                 :3;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned                        :2;
        unsigned _PS0                    :1;  // Note: Changed by MikroE
        unsigned _PS1                    :1;  // Note: Changed by MikroE
        unsigned _PS2                    :1;  // Note: Changed by MikroE
    };
} PWM1CLKCONbits_t;
