MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1574/mcu.h
extern volatile PWM2CLKCONbits_t PWM2CLKCONbits __at(0xDAE);
// bitfield macros
#define _PWM2CLKCON_CS_POSN                                 0x0
#define _PWM2CLKCON_CS_POSITION                             0x0
#define _PWM2CLKCON_CS_SIZE                                 0x2
#define _PWM2CLKCON_CS_LENGTH                               0x2
#define _PWM2CLKCON_CS_MASK                                 0x3
#define _PWM2CLKCON_PS_POSN                                 0x4
#define _PWM2CLKCON_PS_POSITION                             0x4
#define _PWM2CLKCON_PS_SIZE                                 0x3
#define _PWM2CLKCON_PS_LENGTH                               0x3
#define _PWM2CLKCON_PS_MASK                                 0x70
#define _PWM2CLKCON_PWM2CS0_POSN                            0x0
#define _PWM2CLKCON_PWM2CS0_POSITION                        0x0
#define _PWM2CLKCON_PWM2CS0_SIZE                            0x1
#define _PWM2CLKCON_PWM2CS0_LENGTH                          0x1
#define _PWM2CLKCON_PWM2CS0_MASK                            0x1
#define _PWM2CLKCON_PWM2CS1_POSN                            0x1
#define _PWM2CLKCON_PWM2CS1_POSITION                        0x1
#define _PWM2CLKCON_PWM2CS1_SIZE                            0x1
#define _PWM2CLKCON_PWM2CS1_LENGTH                          0x1
#define _PWM2CLKCON_PWM2CS1_MASK                            0x2
#define _PWM2CLKCON_PWM2PS0_POSN                            0x4
#define _PWM2CLKCON_PWM2PS0_POSITION                        0x4
#define _PWM2CLKCON_PWM2PS0_SIZE                            0x1
#define _PWM2CLKCON_PWM2PS0_LENGTH                          0x1
#define _PWM2CLKCON_PWM2PS0_MASK                            0x10
#define _PWM2CLKCON_PWM2PS1_POSN                            0x5
#define _PWM2CLKCON_PWM2PS1_POSITION                        0x5
#define _PWM2CLKCON_PWM2PS1_SIZE                            0x1
#define _PWM2CLKCON_PWM2PS1_LENGTH                          0x1
#define _PWM2CLKCON_PWM2PS1_MASK                            0x20
#define _PWM2CLKCON_PWM2PS2_POSN                            0x6
#define _PWM2CLKCON_PWM2PS2_POSITION                        0x6
#define _PWM2CLKCON_PWM2PS2_SIZE                            0x1
#define _PWM2CLKCON_PWM2PS2_LENGTH                          0x1
#define _PWM2CLKCON_PWM2PS2_MASK                            0x40
#define _PWM2CLKCON_PWM2CS_POSN                             0x0
#define _PWM2CLKCON_PWM2CS_POSITION                         0x0
#define _PWM2CLKCON_PWM2CS_SIZE                             0x3
#define _PWM2CLKCON_PWM2CS_LENGTH                           0x3
#define _PWM2CLKCON_PWM2CS_MASK                             0x7
#define _PWM2CLKCON_PWM2PS_POSN                             0x4
#define _PWM2CLKCON_PWM2PS_POSITION                         0x4
#define _PWM2CLKCON_PWM2PS_SIZE                             0x3
#define _PWM2CLKCON_PWM2PS_LENGTH                           0x3
#define _PWM2CLKCON_PWM2PS_MASK                             0x70
#define _PWM2CLKCON_CS0_POSN                                0x0
#define _PWM2CLKCON_CS0_POSITION                            0x0
#define _PWM2CLKCON_CS0_SIZE                                0x1
#define _PWM2CLKCON_CS0_LENGTH                              0x1
#define _PWM2CLKCON_CS0_MASK                                0x1
#define _PWM2CLKCON_CS1_POSN                                0x1
#define _PWM2CLKCON_CS1_POSITION                            0x1
#define _PWM2CLKCON_CS1_SIZE                                0x1
#define _PWM2CLKCON_CS1_LENGTH                              0x1
#define _PWM2CLKCON_CS1_MASK                                0x2
#define _PWM2CLKCON_PS0_POSN                                0x4
#define _PWM2CLKCON_PS0_POSITION                            0x4
#define _PWM2CLKCON_PS0_SIZE                                0x1
#define _PWM2CLKCON_PS0_LENGTH                              0x1
#define _PWM2CLKCON_PS0_MASK                                0x10
#define _PWM2CLKCON_PS1_POSN                                0x5
#define _PWM2CLKCON_PS1_POSITION                            0x5
#define _PWM2CLKCON_PS1_SIZE                                0x1
#define _PWM2CLKCON_PS1_LENGTH                              0x1
#define _PWM2CLKCON_PS1_MASK                                0x20
#define _PWM2CLKCON_PS2_POSN                                0x6
#define _PWM2CLKCON_PS2_POSITION                            0x6
#define _PWM2CLKCON_PS2_SIZE                                0x1
#define _PWM2CLKCON_PS2_LENGTH                              0x1
#define _PWM2CLKCON_PS2_MASK                                0x40

// Register: PWM2LDCON
#define PWM2LDCON PWM2LDCON
extern volatile unsigned char           PWM2LDCON           __at(0xDAF);
#ifndef _LIB_BUILD
asm("PWM2LDCON equ 0DAFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :2;
        unsigned                        :4;
        unsigned LDT                    :1;
        unsigned LDA                    :1;
    };
    struct {
        unsigned PWM2LDS0               :1;
        unsigned PWM2LDS1               :1;
    };
    struct {
        unsigned PWM2LDS                :2;
        unsigned                        :4;
        unsigned PWM2LDM                :1;
        unsigned PWM2LD                 :1;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
    };
} PWM2LDCONbits_t;
extern volatile PWM2LDCONbits_t PWM2LDCONbits __at(0xDAF);
// bitfield macros
#define _PWM2LDCON_LDS_POSN                                 0x0
#define _PWM2LDCON_LDS_POSITION                             0x0
#define _PWM2LDCON_LDS_SIZE                                 0x2
#define _PWM2LDCON_LDS_LENGTH                               0x2
#define _PWM2LDCON_LDS_MASK                                 0x3
#define _PWM2LDCON_LDT_POSN                                 0x6
#define _PWM2LDCON_LDT_POSITION                             0x6
#define _PWM2LDCON_LDT_SIZE                                 0x1
#define _PWM2LDCON_LDT_LENGTH                               0x1
#define _PWM2LDCON_LDT_MASK                                 0x40
#define _PWM2LDCON_LDA_POSN                                 0x7
#define _PWM2LDCON_LDA_POSITION                             0x7
#define _PWM2LDCON_LDA_SIZE                                 0x1
#define _PWM2LDCON_LDA_LENGTH                               0x1
#define _PWM2LDCON_LDA_MASK                                 0x80
#define _PWM2LDCON_PWM2LDS0_POSN                            0x0
#define _PWM2LDCON_PWM2LDS0_POSITION                        0x0
#define _PWM2LDCON_PWM2LDS0_SIZE                            0x1
#define _PWM2LDCON_PWM2LDS0_LENGTH                          0x1
#define _PWM2LDCON_PWM2LDS0_MASK                            0x1
#define _PWM2LDCON_PWM2LDS1_POSN                            0x1
#define _PWM2LDCON_PWM2LDS1_POSITION                        0x1
#define _PWM2LDCON_PWM2LDS1_SIZE                            0x1
#define _PWM2LDCON_PWM2LDS1_LENGTH                          0x1
#define _PWM2LDCON_PWM2LDS1_MASK                            0x2
#define _PWM2LDCON_PWM2LDS_POSN                             0x0
#define _PWM2LDCON_PWM2LDS_POSITION                         0x0
#define _PWM2LDCON_PWM2LDS_SIZE                             0x2
#define _PWM2LDCON_PWM2LDS_LENGTH                           0x2
#define _PWM2LDCON_PWM2LDS_MASK                             0x3
#define _PWM2LDCON_PWM2LDM_POSN                             0x6
#define _PWM2LDCON_PWM2LDM_POSITION                         0x6
#define _PWM2LDCON_PWM2LDM_SIZE                             0x1
#define _PWM2LDCON_PWM2LDM_LENGTH                           0x1
#define _PWM2LDCON_PWM2LDM_MASK                             0x40
#define _PWM2LDCON_PWM2LD_POSN                              0x7
#define _PWM2LDCON_PWM2LD_POSITION                          0x7
#define _PWM2LDCON_PWM2LD_SIZE                              0x1
#define _PWM2LDCON_PWM2LD_LENGTH                            0x1
#define _PWM2LDCON_PWM2LD_MASK                              0x80
#define _PWM2LDCON_LDS0_POSN                                0x0
#define _PWM2LDCON_LDS0_POSITION                            0x0
#define _PWM2LDCON_LDS0_SIZE                                0x1
#define _PWM2LDCON_LDS0_LENGTH                              0x1
#define _PWM2LDCON_LDS0_MASK                                0x1
#define _PWM2LDCON_LDS1_POSN                                0x1
#define _PWM2LDCON_LDS1_POSITION                            0x1
#define _PWM2LDCON_LDS1_SIZE                                0x1
#define _PWM2LDCON_LDS1_LENGTH                              0x1
#define _PWM2LDCON_LDS1_MASK                                0x2

