MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1574/mcu.h
// Register: PWM4DCH
#define PWM4DCH PWM4DCH
extern volatile unsigned char           PWM4DCH             __at(0xDC4);
#ifndef _LIB_BUILD
asm("PWM4DCH equ 0DC4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned PWM4DCH0               :1;
        unsigned PWM4DCH1               :1;
        unsigned PWM4DCH2               :1;
        unsigned PWM4DCH3               :1;
        unsigned PWM4DCH4               :1;
        unsigned PWM4DCH5               :1;
        unsigned PWM4DCH6               :1;
        unsigned PWM4DCH7               :1;
    };
    struct {
        unsigned PWM4DCH                :8;
    };
} PWM4DCHbits_t;
extern volatile PWM4DCHbits_t PWM4DCHbits __at(0xDC4);
// bitfield macros
#define _PWM4DCH_DC_POSN                                    0x0
#define _PWM4DCH_DC_POSITION                                0x0
#define _PWM4DCH_DC_SIZE                                    0x8
#define _PWM4DCH_DC_LENGTH                                  0x8
#define _PWM4DCH_DC_MASK                                    0xFF
#define _PWM4DCH_PWM4DCH0_POSN                              0x0
#define _PWM4DCH_PWM4DCH0_POSITION                          0x0
#define _PWM4DCH_PWM4DCH0_SIZE                              0x1
#define _PWM4DCH_PWM4DCH0_LENGTH                            0x1
#define _PWM4DCH_PWM4DCH0_MASK                              0x1
#define _PWM4DCH_PWM4DCH1_POSN                              0x1
#define _PWM4DCH_PWM4DCH1_POSITION                          0x1
#define _PWM4DCH_PWM4DCH1_SIZE                              0x1
#define _PWM4DCH_PWM4DCH1_LENGTH                            0x1
#define _PWM4DCH_PWM4DCH1_MASK                              0x2
#define _PWM4DCH_PWM4DCH2_POSN                              0x2
#define _PWM4DCH_PWM4DCH2_POSITION                          0x2
#define _PWM4DCH_PWM4DCH2_SIZE                              0x1
#define _PWM4DCH_PWM4DCH2_LENGTH                            0x1
#define _PWM4DCH_PWM4DCH2_MASK                              0x4
#define _PWM4DCH_PWM4DCH3_POSN                              0x3
#define _PWM4DCH_PWM4DCH3_POSITION                          0x3
#define _PWM4DCH_PWM4DCH3_SIZE                              0x1
#define _PWM4DCH_PWM4DCH3_LENGTH                            0x1
#define _PWM4DCH_PWM4DCH3_MASK                              0x8
#define _PWM4DCH_PWM4DCH4_POSN                              0x4
#define _PWM4DCH_PWM4DCH4_POSITION                          0x4
#define _PWM4DCH_PWM4DCH4_SIZE                              0x1
#define _PWM4DCH_PWM4DCH4_LENGTH                            0x1
#define _PWM4DCH_PWM4DCH4_MASK                              0x10
#define _PWM4DCH_PWM4DCH5_POSN                              0x5
#define _PWM4DCH_PWM4DCH5_POSITION                          0x5
#define _PWM4DCH_PWM4DCH5_SIZE                              0x1
#define _PWM4DCH_PWM4DCH5_LENGTH                            0x1
#define _PWM4DCH_PWM4DCH5_MASK                              0x20
#define _PWM4DCH_PWM4DCH6_POSN                              0x6
#define _PWM4DCH_PWM4DCH6_POSITION                          0x6
#define _PWM4DCH_PWM4DCH6_SIZE                              0x1
#define _PWM4DCH_PWM4DCH6_LENGTH                            0x1
#define _PWM4DCH_PWM4DCH6_MASK                              0x40
#define _PWM4DCH_PWM4DCH7_POSN                              0x7
#define _PWM4DCH_PWM4DCH7_POSITION                          0x7
#define _PWM4DCH_PWM4DCH7_SIZE                              0x1
#define _PWM4DCH_PWM4DCH7_LENGTH                            0x1
#define _PWM4DCH_PWM4DCH7_MASK                              0x80
#define _PWM4DCH_PWM4DCH_POSN                               0x0
#define _PWM4DCH_PWM4DCH_POSITION                           0x0
#define _PWM4DCH_PWM4DCH_SIZE                               0x8
#define _PWM4DCH_PWM4DCH_LENGTH                             0x8
#define _PWM4DCH_PWM4DCH_MASK                               0xFF

// Register: PWM4PR
#define PWM4PR PWM4PR
extern volatile unsigned short          PWM4PR              __at(0xDC5);
#ifndef _LIB_BUILD
asm("PWM4PR equ 0DC5h");
#endif

// Register: PWM4PRL
#define PWM4PRL PWM4PRL
extern volatile unsigned char           PWM4PRL             __at(0xDC5);
#ifndef _LIB_BUILD
asm("PWM4PRL equ 0DC5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PWM4PRL0               :1;
        unsigned PWM4PRL1               :1;
        unsigned PWM4PRL2               :1;
        unsigned PWM4PRL3               :1;
        unsigned PWM4PRL4               :1;
        unsigned PWM4PRL5               :1;
        unsigned PWM4PRL6               :1;
        unsigned PWM4PRL7               :1;
    };
    struct {
        unsigned PWM4PRL                :8;
    };
} PWM4PRLbits_t;
extern volatile PWM4PRLbits_t PWM4PRLbits __at(0xDC5);
// bitfield macros
#define _PWM4PRL_PR_POSN                                    0x0
#define _PWM4PRL_PR_POSITION                                0x0
#define _PWM4PRL_PR_SIZE                                    0x8
#define _PWM4PRL_PR_LENGTH                                  0x8
#define _PWM4PRL_PR_MASK                                    0xFF
#define _PWM4PRL_PWM4PRL0_POSN                              0x0
#define _PWM4PRL_PWM4PRL0_POSITION                          0x0
#define _PWM4PRL_PWM4PRL0_SIZE                              0x1
#define _PWM4PRL_PWM4PRL0_LENGTH                            0x1
#define _PWM4PRL_PWM4PRL0_MASK                              0x1
#define _PWM4PRL_PWM4PRL1_POSN                              0x1
#define _PWM4PRL_PWM4PRL1_POSITION                          0x1
#define _PWM4PRL_PWM4PRL1_SIZE                              0x1
#define _PWM4PRL_PWM4PRL1_LENGTH                            0x1
#define _PWM4PRL_PWM4PRL1_MASK                              0x2
#define _PWM4PRL_PWM4PRL2_POSN                              0x2
#define _PWM4PRL_PWM4PRL2_POSITION                          0x2
#define _PWM4PRL_PWM4PRL2_SIZE                              0x1
#define _PWM4PRL_PWM4PRL2_LENGTH                            0x1
#define _PWM4PRL_PWM4PRL2_MASK                              0x4
#define _PWM4PRL_PWM4PRL3_POSN                              0x3
#define _PWM4PRL_PWM4PRL3_POSITION                          0x3
#define _PWM4PRL_PWM4PRL3_SIZE                              0x1
#define _PWM4PRL_PWM4PRL3_LENGTH                            0x1
#define _PWM4PRL_PWM4PRL3_MASK                              0x8
#define _PWM4PRL_PWM4PRL4_POSN                              0x4
#define _PWM4PRL_PWM4PRL4_POSITION                          0x4
#define _PWM4PRL_PWM4PRL4_SIZE                              0x1
#define _PWM4PRL_PWM4PRL4_LENGTH                            0x1
#define _PWM4PRL_PWM4PRL4_MASK                              0x10
#define _PWM4PRL_PWM4PRL5_POSN                              0x5
#define _PWM4PRL_PWM4PRL5_POSITION                          0x5
#define _PWM4PRL_PWM4PRL5_SIZE                              0x1
#define _PWM4PRL_PWM4PRL5_LENGTH                            0x1
#define _PWM4PRL_PWM4PRL5_MASK                              0x20
#define _PWM4PRL_PWM4PRL6_POSN                              0x6
#define _PWM4PRL_PWM4PRL6_POSITION                          0x6
#define _PWM4PRL_PWM4PRL6_SIZE                              0x1
#define _PWM4PRL_PWM4PRL6_LENGTH                            0x1
#define _PWM4PRL_PWM4PRL6_MASK                              0x40
#define _PWM4PRL_PWM4PRL7_POSN                              0x7
#define _PWM4PRL_PWM4PRL7_POSITION                          0x7
#define _PWM4PRL_PWM4PRL7_SIZE                              0x1
#define _PWM4PRL_PWM4PRL7_LENGTH                            0x1
#define _PWM4PRL_PWM4PRL7_MASK                              0x80
#define _PWM4PRL_PWM4PRL_POSN                               0x0
#define _PWM4PRL_PWM4PRL_POSITION                           0x0
#define _PWM4PRL_PWM4PRL_SIZE                               0x8
#define _PWM4PRL_PWM4PRL_LENGTH                             0x8
#define _PWM4PRL_PWM4PRL_MASK                               0xFF

