MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1574/mcu.h
extern volatile PWM4INTFbits_t PWM4INTFbits __at(0xDCD);
// bitfield macros
#define _PWM4INTF_PRIF_POSN                                 0x0
#define _PWM4INTF_PRIF_POSITION                             0x0
#define _PWM4INTF_PRIF_SIZE                                 0x1
#define _PWM4INTF_PRIF_LENGTH                               0x1
#define _PWM4INTF_PRIF_MASK                                 0x1
#define _PWM4INTF_DCIF_POSN                                 0x1
#define _PWM4INTF_DCIF_POSITION                             0x1
#define _PWM4INTF_DCIF_SIZE                                 0x1
#define _PWM4INTF_DCIF_LENGTH                               0x1
#define _PWM4INTF_DCIF_MASK                                 0x2
#define _PWM4INTF_PHIF_POSN                                 0x2
#define _PWM4INTF_PHIF_POSITION                             0x2
#define _PWM4INTF_PHIF_SIZE                                 0x1
#define _PWM4INTF_PHIF_LENGTH                               0x1
#define _PWM4INTF_PHIF_MASK                                 0x4
#define _PWM4INTF_OFIF_POSN                                 0x3
#define _PWM4INTF_OFIF_POSITION                             0x3
#define _PWM4INTF_OFIF_SIZE                                 0x1
#define _PWM4INTF_OFIF_LENGTH                               0x1
#define _PWM4INTF_OFIF_MASK                                 0x8
#define _PWM4INTF_PWM4PRIF_POSN                             0x0
#define _PWM4INTF_PWM4PRIF_POSITION                         0x0
#define _PWM4INTF_PWM4PRIF_SIZE                             0x1
#define _PWM4INTF_PWM4PRIF_LENGTH                           0x1
#define _PWM4INTF_PWM4PRIF_MASK                             0x1
#define _PWM4INTF_PWM4DCIF_POSN                             0x1
#define _PWM4INTF_PWM4DCIF_POSITION                         0x1
#define _PWM4INTF_PWM4DCIF_SIZE                             0x1
#define _PWM4INTF_PWM4DCIF_LENGTH                           0x1
#define _PWM4INTF_PWM4DCIF_MASK                             0x2
#define _PWM4INTF_PWM4PHIF_POSN                             0x2
#define _PWM4INTF_PWM4PHIF_POSITION                         0x2
#define _PWM4INTF_PWM4PHIF_SIZE                             0x1
#define _PWM4INTF_PWM4PHIF_LENGTH                           0x1
#define _PWM4INTF_PWM4PHIF_MASK                             0x4
#define _PWM4INTF_PWM4OFIF_POSN                             0x3
#define _PWM4INTF_PWM4OFIF_POSITION                         0x3
#define _PWM4INTF_PWM4OFIF_SIZE                             0x1
#define _PWM4INTF_PWM4OFIF_LENGTH                           0x1
#define _PWM4INTF_PWM4OFIF_MASK                             0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM4PRIF               :1;
        unsigned PWM4DCIF               :1;
        unsigned PWM4PHIF               :1;
        unsigned PWM4OFIF               :1;
    };
} PWM4INTFLGbits_t;
extern volatile PWM4INTFLGbits_t PWM4INTFLGbits __at(0xDCD);
// bitfield macros
#define _PWM4INTFLG_PRIF_POSN                               0x0
#define _PWM4INTFLG_PRIF_POSITION                           0x0
#define _PWM4INTFLG_PRIF_SIZE                               0x1
#define _PWM4INTFLG_PRIF_LENGTH                             0x1
#define _PWM4INTFLG_PRIF_MASK                               0x1
#define _PWM4INTFLG_DCIF_POSN                               0x1
#define _PWM4INTFLG_DCIF_POSITION                           0x1
#define _PWM4INTFLG_DCIF_SIZE                               0x1
#define _PWM4INTFLG_DCIF_LENGTH                             0x1
#define _PWM4INTFLG_DCIF_MASK                               0x2
#define _PWM4INTFLG_PHIF_POSN                               0x2
#define _PWM4INTFLG_PHIF_POSITION                           0x2
#define _PWM4INTFLG_PHIF_SIZE                               0x1
#define _PWM4INTFLG_PHIF_LENGTH                             0x1
#define _PWM4INTFLG_PHIF_MASK                               0x4
#define _PWM4INTFLG_OFIF_POSN                               0x3
#define _PWM4INTFLG_OFIF_POSITION                           0x3
#define _PWM4INTFLG_OFIF_SIZE                               0x1
#define _PWM4INTFLG_OFIF_LENGTH                             0x1
#define _PWM4INTFLG_OFIF_MASK                               0x8
#define _PWM4INTFLG_PWM4PRIF_POSN                           0x0
#define _PWM4INTFLG_PWM4PRIF_POSITION                       0x0
#define _PWM4INTFLG_PWM4PRIF_SIZE                           0x1
#define _PWM4INTFLG_PWM4PRIF_LENGTH                         0x1
#define _PWM4INTFLG_PWM4PRIF_MASK                           0x1
#define _PWM4INTFLG_PWM4DCIF_POSN                           0x1
#define _PWM4INTFLG_PWM4DCIF_POSITION                       0x1
#define _PWM4INTFLG_PWM4DCIF_SIZE                           0x1
#define _PWM4INTFLG_PWM4DCIF_LENGTH                         0x1
#define _PWM4INTFLG_PWM4DCIF_MASK                           0x2
#define _PWM4INTFLG_PWM4PHIF_POSN                           0x2
#define _PWM4INTFLG_PWM4PHIF_POSITION                       0x2
#define _PWM4INTFLG_PWM4PHIF_SIZE                           0x1
#define _PWM4INTFLG_PWM4PHIF_LENGTH                         0x1
#define _PWM4INTFLG_PWM4PHIF_MASK                           0x4
#define _PWM4INTFLG_PWM4OFIF_POSN                           0x3
#define _PWM4INTFLG_PWM4OFIF_POSITION                       0x3
#define _PWM4INTFLG_PWM4OFIF_SIZE                           0x1
#define _PWM4INTFLG_PWM4OFIF_LENGTH                         0x1
#define _PWM4INTFLG_PWM4OFIF_MASK                           0x8

// Register: PWM4CLKCON
#define PWM4CLKCON PWM4CLKCON
extern volatile unsigned char           PWM4CLKCON          __at(0xDCE);
#ifndef _LIB_BUILD
asm("PWM4CLKCON equ 0DCEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :2;
        unsigned                        :2;
        unsigned PS                     :3;
    };
    struct {
        unsigned PWM4CS0                :1;
        unsigned PWM4CS1                :1;
        unsigned                        :2;
        unsigned PWM4PS0                :1;
        unsigned PWM4PS1                :1;
        unsigned PWM4PS2                :1;
    };
    struct {
        unsigned PWM4CS                 :3;
        unsigned                        :1;
        unsigned PWM4PS                 :3;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned                        :2;
        unsigned _PS0                    :1;  // Note: Changed by MikroE
        unsigned _PS1                    :1;  // Note: Changed by MikroE
        unsigned _PS2                    :1;  // Note: Changed by MikroE
    };
} PWM4CLKCONbits_t;
extern volatile PWM4CLKCONbits_t PWM4CLKCONbits __at(0xDCE);
// bitfield macros
#define _PWM4CLKCON_CS_POSN                                 0x0
#define _PWM4CLKCON_CS_POSITION                             0x0
#define _PWM4CLKCON_CS_SIZE                                 0x2
#define _PWM4CLKCON_CS_LENGTH                               0x2
#define _PWM4CLKCON_CS_MASK                                 0x3
#define _PWM4CLKCON_PS_POSN                                 0x4
#define _PWM4CLKCON_PS_POSITION                             0x4
#define _PWM4CLKCON_PS_SIZE                                 0x3
#define _PWM4CLKCON_PS_LENGTH                               0x3
#define _PWM4CLKCON_PS_MASK                                 0x70
#define _PWM4CLKCON_PWM4CS0_POSN                            0x0
#define _PWM4CLKCON_PWM4CS0_POSITION                        0x0
#define _PWM4CLKCON_PWM4CS0_SIZE                            0x1
#define _PWM4CLKCON_PWM4CS0_LENGTH                          0x1
#define _PWM4CLKCON_PWM4CS0_MASK                            0x1
#define _PWM4CLKCON_PWM4CS1_POSN                            0x1
#define _PWM4CLKCON_PWM4CS1_POSITION                        0x1
#define _PWM4CLKCON_PWM4CS1_SIZE                            0x1
#define _PWM4CLKCON_PWM4CS1_LENGTH                          0x1
#define _PWM4CLKCON_PWM4CS1_MASK                            0x2
#define _PWM4CLKCON_PWM4PS0_POSN                            0x4
#define _PWM4CLKCON_PWM4PS0_POSITION                        0x4
#define _PWM4CLKCON_PWM4PS0_SIZE                            0x1
#define _PWM4CLKCON_PWM4PS0_LENGTH                          0x1
#define _PWM4CLKCON_PWM4PS0_MASK                            0x10
#define _PWM4CLKCON_PWM4PS1_POSN                            0x5
#define _PWM4CLKCON_PWM4PS1_POSITION                        0x5
#define _PWM4CLKCON_PWM4PS1_SIZE                            0x1
#define _PWM4CLKCON_PWM4PS1_LENGTH                          0x1
#define _PWM4CLKCON_PWM4PS1_MASK                            0x20
#define _PWM4CLKCON_PWM4PS2_POSN                            0x6
#define _PWM4CLKCON_PWM4PS2_POSITION                        0x6
#define _PWM4CLKCON_PWM4PS2_SIZE                            0x1
#define _PWM4CLKCON_PWM4PS2_LENGTH                          0x1
#define _PWM4CLKCON_PWM4PS2_MASK                            0x40
#define _PWM4CLKCON_PWM4CS_POSN                             0x0
#define _PWM4CLKCON_PWM4CS_POSITION                         0x0
#define _PWM4CLKCON_PWM4CS_SIZE                             0x3
#define _PWM4CLKCON_PWM4CS_LENGTH                           0x3
#define _PWM4CLKCON_PWM4CS_MASK                             0x7
#define _PWM4CLKCON_PWM4PS_POSN                             0x4
#define _PWM4CLKCON_PWM4PS_POSITION                         0x4
#define _PWM4CLKCON_PWM4PS_SIZE                             0x3
#define _PWM4CLKCON_PWM4PS_LENGTH                           0x3
#define _PWM4CLKCON_PWM4PS_MASK                             0x70
#define _PWM4CLKCON_CS0_POSN                                0x0
#define _PWM4CLKCON_CS0_POSITION                            0x0
#define _PWM4CLKCON_CS0_SIZE                                0x1
#define _PWM4CLKCON_CS0_LENGTH                              0x1
#define _PWM4CLKCON_CS0_MASK                                0x1
#define _PWM4CLKCON_CS1_POSN                                0x1
#define _PWM4CLKCON_CS1_POSITION                            0x1
#define _PWM4CLKCON_CS1_SIZE                                0x1
#define _PWM4CLKCON_CS1_LENGTH                              0x1
#define _PWM4CLKCON_CS1_MASK                                0x2
#define _PWM4CLKCON_PS0_POSN                                0x4
#define _PWM4CLKCON_PS0_POSITION                            0x4
#define _PWM4CLKCON_PS0_SIZE                                0x1
#define _PWM4CLKCON_PS0_LENGTH                              0x1
#define _PWM4CLKCON_PS0_MASK                                0x10
#define _PWM4CLKCON_PS1_POSN                                0x5
#define _PWM4CLKCON_PS1_POSITION                            0x5
#define _PWM4CLKCON_PS1_SIZE                                0x1
#define _PWM4CLKCON_PS1_LENGTH                              0x1
#define _PWM4CLKCON_PS1_MASK                                0x20
#define _PWM4CLKCON_PS2_POSN                                0x6
#define _PWM4CLKCON_PS2_POSITION                            0x6
#define _PWM4CLKCON_PS2_SIZE                                0x1
#define _PWM4CLKCON_PS2_LENGTH                              0x1
#define _PWM4CLKCON_PS2_MASK                                0x40

// Register: PWM4LDCON
#define PWM4LDCON PWM4LDCON
extern volatile unsigned char           PWM4LDCON           __at(0xDCF);
#ifndef _LIB_BUILD
asm("PWM4LDCON equ 0DCFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :2;
        unsigned                        :4;
        unsigned LDT                    :1;
        unsigned LDA                    :1;
    };
    struct {
        unsigned PWM4LDS0               :1;
        unsigned PWM4LDS1               :1;
    };
    struct {
        unsigned PWM4LDS                :2;
        unsigned                        :4;
        unsigned PWM4LDM                :1;
        unsigned PWM4LD                 :1;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
    };
} PWM4LDCONbits_t;
extern volatile PWM4LDCONbits_t PWM4LDCONbits __at(0xDCF);
// bitfield macros
#define _PWM4LDCON_LDS_POSN                                 0x0
#define _PWM4LDCON_LDS_POSITION                             0x0
#define _PWM4LDCON_LDS_SIZE                                 0x2
#define _PWM4LDCON_LDS_LENGTH                               0x2
#define _PWM4LDCON_LDS_MASK                                 0x3
#define _PWM4LDCON_LDT_POSN                                 0x6
#define _PWM4LDCON_LDT_POSITION                             0x6
#define _PWM4LDCON_LDT_SIZE                                 0x1
#define _PWM4LDCON_LDT_LENGTH                               0x1
#define _PWM4LDCON_LDT_MASK                                 0x40
#define _PWM4LDCON_LDA_POSN                                 0x7
#define _PWM4LDCON_LDA_POSITION                             0x7
#define _PWM4LDCON_LDA_SIZE                                 0x1
#define _PWM4LDCON_LDA_LENGTH                               0x1
#define _PWM4LDCON_LDA_MASK                                 0x80
#define _PWM4LDCON_PWM4LDS0_POSN                            0x0
#define _PWM4LDCON_PWM4LDS0_POSITION                        0x0
#define _PWM4LDCON_PWM4LDS0_SIZE                            0x1
#define _PWM4LDCON_PWM4LDS0_LENGTH                          0x1
#define _PWM4LDCON_PWM4LDS0_MASK                            0x1
#define _PWM4LDCON_PWM4LDS1_POSN                            0x1
#define _PWM4LDCON_PWM4LDS1_POSITION                        0x1
#define _PWM4LDCON_PWM4LDS1_SIZE                            0x1
#define _PWM4LDCON_PWM4LDS1_LENGTH                          0x1
#define _PWM4LDCON_PWM4LDS1_MASK                            0x2
#define _PWM4LDCON_PWM4LDS_POSN                             0x0
#define _PWM4LDCON_PWM4LDS_POSITION                         0x0
#define _PWM4LDCON_PWM4LDS_SIZE                             0x2
#define _PWM4LDCON_PWM4LDS_LENGTH                           0x2
#define _PWM4LDCON_PWM4LDS_MASK                             0x3
#define _PWM4LDCON_PWM4LDM_POSN                             0x6
#define _PWM4LDCON_PWM4LDM_POSITION                         0x6
#define _PWM4LDCON_PWM4LDM_SIZE                             0x1
#define _PWM4LDCON_PWM4LDM_LENGTH                           0x1
#define _PWM4LDCON_PWM4LDM_MASK                             0x40
#define _PWM4LDCON_PWM4LD_POSN                              0x7
#define _PWM4LDCON_PWM4LD_POSITION                          0x7
#define _PWM4LDCON_PWM4LD_SIZE                              0x1
#define _PWM4LDCON_PWM4LD_LENGTH                            0x1
#define _PWM4LDCON_PWM4LD_MASK                              0x80
#define _PWM4LDCON_LDS0_POSN                                0x0
#define _PWM4LDCON_LDS0_POSITION                            0x0
#define _PWM4LDCON_LDS0_SIZE                                0x1
#define _PWM4LDCON_LDS0_LENGTH                              0x1
#define _PWM4LDCON_LDS0_MASK                                0x1
#define _PWM4LDCON_LDS1_POSN                                0x1
#define _PWM4LDCON_LDS1_POSITION                            0x1
#define _PWM4LDCON_LDS1_SIZE                                0x1
#define _PWM4LDCON_LDS1_LENGTH                              0x1
#define _PWM4LDCON_LDS1_MASK                                0x2

// Register: PWM4OFCON
#define PWM4OFCON PWM4OFCON
extern volatile unsigned char           PWM4OFCON           __at(0xDD0);
#ifndef _LIB_BUILD
asm("PWM4OFCON equ 0DD0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OFS                    :2;
        unsigned                        :2;
        unsigned OFO                    :1;
        unsigned OFM                    :2;
    };
    struct {
        unsigned PWM4OFS0               :1;
        unsigned PWM4OFS1               :1;
        unsigned                        :3;
        unsigned PWM4OFM0               :1;
        unsigned PWM4OFM1               :1;
    };
    struct {
        unsigned PWM4OFS                :2;
        unsigned                        :2;
        unsigned PWM4OFMC               :1;
        unsigned PWM4OFM                :2;
    };
    struct {
        unsigned OFS0                   :1;
        unsigned OFS1                   :1;
        unsigned                        :3;
        unsigned OFM0                   :1;
        unsigned OFM1                   :1;
    };
} PWM4OFCONbits_t;
extern volatile PWM4OFCONbits_t PWM4OFCONbits __at(0xDD0);
// bitfield macros
#define _PWM4OFCON_OFS_POSN                                 0x0
#define _PWM4OFCON_OFS_POSITION                             0x0
#define _PWM4OFCON_OFS_SIZE                                 0x2
#define _PWM4OFCON_OFS_LENGTH                               0x2
#define _PWM4OFCON_OFS_MASK                                 0x3
#define _PWM4OFCON_OFO_POSN                                 0x4
#define _PWM4OFCON_OFO_POSITION                             0x4
#define _PWM4OFCON_OFO_SIZE                                 0x1
#define _PWM4OFCON_OFO_LENGTH                               0x1
#define _PWM4OFCON_OFO_MASK                                 0x10
#define _PWM4OFCON_OFM_POSN                                 0x5
#define _PWM4OFCON_OFM_POSITION                             0x5
#define _PWM4OFCON_OFM_SIZE                                 0x2
#define _PWM4OFCON_OFM_LENGTH                               0x2
#define _PWM4OFCON_OFM_MASK                                 0x60
#define _PWM4OFCON_PWM4OFS0_POSN                            0x0
#define _PWM4OFCON_PWM4OFS0_POSITION                        0x0
#define _PWM4OFCON_PWM4OFS0_SIZE                            0x1
#define _PWM4OFCON_PWM4OFS0_LENGTH                          0x1
#define _PWM4OFCON_PWM4OFS0_MASK                            0x1
#define _PWM4OFCON_PWM4OFS1_POSN                            0x1
#define _PWM4OFCON_PWM4OFS1_POSITION                        0x1
#define _PWM4OFCON_PWM4OFS1_SIZE                            0x1
#define _PWM4OFCON_PWM4OFS1_LENGTH                          0x1
#define _PWM4OFCON_PWM4OFS1_MASK                            0x2
#define _PWM4OFCON_PWM4OFM0_POSN                            0x5
#define _PWM4OFCON_PWM4OFM0_POSITION                        0x5
#define _PWM4OFCON_PWM4OFM0_SIZE                            0x1
#define _PWM4OFCON_PWM4OFM0_LENGTH                          0x1
#define _PWM4OFCON_PWM4OFM0_MASK                            0x20
#define _PWM4OFCON_PWM4OFM1_POSN                            0x6
#define _PWM4OFCON_PWM4OFM1_POSITION                        0x6
#define _PWM4OFCON_PWM4OFM1_SIZE                            0x1
#define _PWM4OFCON_PWM4OFM1_LENGTH                          0x1
#define _PWM4OFCON_PWM4OFM1_MASK                            0x40
#define _PWM4OFCON_PWM4OFS_POSN                             0x0
#define _PWM4OFCON_PWM4OFS_POSITION                         0x0
#define _PWM4OFCON_PWM4OFS_SIZE                             0x2
#define _PWM4OFCON_PWM4OFS_LENGTH                           0x2
#define _PWM4OFCON_PWM4OFS_MASK                             0x3
#define _PWM4OFCON_PWM4OFMC_POSN                            0x4
#define _PWM4OFCON_PWM4OFMC_POSITION                        0x4
#define _PWM4OFCON_PWM4OFMC_SIZE                            0x1
#define _PWM4OFCON_PWM4OFMC_LENGTH                          0x1
#define _PWM4OFCON_PWM4OFMC_MASK                            0x10
#define _PWM4OFCON_PWM4OFM_POSN                             0x5
#define _PWM4OFCON_PWM4OFM_POSITION                         0x5
#define _PWM4OFCON_PWM4OFM_SIZE                             0x2
#define _PWM4OFCON_PWM4OFM_LENGTH                           0x2
#define _PWM4OFCON_PWM4OFM_MASK                             0x60
#define _PWM4OFCON_OFS0_POSN                                0x0
#define _PWM4OFCON_OFS0_POSITION                            0x0
#define _PWM4OFCON_OFS0_SIZE                                0x1
#define _PWM4OFCON_OFS0_LENGTH                              0x1
#define _PWM4OFCON_OFS0_MASK                                0x1
#define _PWM4OFCON_OFS1_POSN                                0x1
#define _PWM4OFCON_OFS1_POSITION                            0x1
#define _PWM4OFCON_OFS1_SIZE                                0x1
#define _PWM4OFCON_OFS1_LENGTH                              0x1
#define _PWM4OFCON_OFS1_MASK                                0x2
#define _PWM4OFCON_OFM0_POSN                                0x5
#define _PWM4OFCON_OFM0_POSITION                            0x5
#define _PWM4OFCON_OFM0_SIZE                                0x1
#define _PWM4OFCON_OFM0_LENGTH                              0x1
#define _PWM4OFCON_OFM0_MASK                                0x20
#define _PWM4OFCON_OFM1_POSN                                0x6
#define _PWM4OFCON_OFM1_POSITION                            0x6
#define _PWM4OFCON_OFM1_SIZE                                0x1
#define _PWM4OFCON_OFM1_LENGTH                              0x1
#define _PWM4OFCON_OFM1_MASK                                0x40

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
extern volatile unsigned char           PPSLOCK             __at(0xE0F);
#ifndef _LIB_BUILD
asm("PPSLOCK equ 0E0Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PPSLOCKED              :1;
    };
} PPSLOCKbits_t;
