MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1574/mcu.h
// Register: CKPPS
#define CKPPS CKPPS
extern volatile unsigned char           CKPPS               __at(0xE16);
#ifndef _LIB_BUILD
asm("CKPPS equ 0E16h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CKPPS                  :5;
    };
    struct {
        unsigned CKPPS0                 :1;
        unsigned CKPPS1                 :1;
        unsigned CKPPS2                 :1;
        unsigned CKPPS3                 :1;
        unsigned CKPPS4                 :1;
    };
} CKPPSbits_t;
extern volatile CKPPSbits_t CKPPSbits __at(0xE16);
// bitfield macros
#define _CKPPS_CKPPS_POSN                                   0x0
#define _CKPPS_CKPPS_POSITION                               0x0
#define _CKPPS_CKPPS_SIZE                                   0x5
#define _CKPPS_CKPPS_LENGTH                                 0x5
#define _CKPPS_CKPPS_MASK                                   0x1F
#define _CKPPS_CKPPS0_POSN                                  0x0
#define _CKPPS_CKPPS0_POSITION                              0x0
#define _CKPPS_CKPPS0_SIZE                                  0x1
#define _CKPPS_CKPPS0_LENGTH                                0x1
#define _CKPPS_CKPPS0_MASK                                  0x1
#define _CKPPS_CKPPS1_POSN                                  0x1
#define _CKPPS_CKPPS1_POSITION                              0x1
#define _CKPPS_CKPPS1_SIZE                                  0x1
#define _CKPPS_CKPPS1_LENGTH                                0x1
#define _CKPPS_CKPPS1_MASK                                  0x2
#define _CKPPS_CKPPS2_POSN                                  0x2
#define _CKPPS_CKPPS2_POSITION                              0x2
#define _CKPPS_CKPPS2_SIZE                                  0x1
#define _CKPPS_CKPPS2_LENGTH                                0x1
#define _CKPPS_CKPPS2_MASK                                  0x4
#define _CKPPS_CKPPS3_POSN                                  0x3
#define _CKPPS_CKPPS3_POSITION                              0x3
#define _CKPPS_CKPPS3_SIZE                                  0x1
#define _CKPPS_CKPPS3_LENGTH                                0x1
#define _CKPPS_CKPPS3_MASK                                  0x8
#define _CKPPS_CKPPS4_POSN                                  0x4
#define _CKPPS_CKPPS4_POSITION                              0x4
#define _CKPPS_CKPPS4_SIZE                                  0x1
#define _CKPPS_CKPPS4_LENGTH                                0x1
#define _CKPPS_CKPPS4_MASK                                  0x10

// Register: ADCACTPPS
#define ADCACTPPS ADCACTPPS
extern volatile unsigned char           ADCACTPPS           __at(0xE17);
#ifndef _LIB_BUILD
asm("ADCACTPPS equ 0E17h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCACTPPS              :5;
    };
    struct {
        unsigned ADCACTPPS0             :1;
        unsigned ADCACTPPS1             :1;
        unsigned ADCACTPPS2             :1;
        unsigned ADCACTPPS3             :1;
        unsigned ADCACTPPS4             :1;
    };
} ADCACTPPSbits_t;
extern volatile ADCACTPPSbits_t ADCACTPPSbits __at(0xE17);
// bitfield macros
#define _ADCACTPPS_ADCACTPPS_POSN                           0x0
#define _ADCACTPPS_ADCACTPPS_POSITION                       0x0
#define _ADCACTPPS_ADCACTPPS_SIZE                           0x5
#define _ADCACTPPS_ADCACTPPS_LENGTH                         0x5
#define _ADCACTPPS_ADCACTPPS_MASK                           0x1F
#define _ADCACTPPS_ADCACTPPS0_POSN                          0x0
#define _ADCACTPPS_ADCACTPPS0_POSITION                      0x0
#define _ADCACTPPS_ADCACTPPS0_SIZE                          0x1
#define _ADCACTPPS_ADCACTPPS0_LENGTH                        0x1
#define _ADCACTPPS_ADCACTPPS0_MASK                          0x1
#define _ADCACTPPS_ADCACTPPS1_POSN                          0x1
#define _ADCACTPPS_ADCACTPPS1_POSITION                      0x1
#define _ADCACTPPS_ADCACTPPS1_SIZE                          0x1
#define _ADCACTPPS_ADCACTPPS1_LENGTH                        0x1
#define _ADCACTPPS_ADCACTPPS1_MASK                          0x2
#define _ADCACTPPS_ADCACTPPS2_POSN                          0x2
#define _ADCACTPPS_ADCACTPPS2_POSITION                      0x2
#define _ADCACTPPS_ADCACTPPS2_SIZE                          0x1
#define _ADCACTPPS_ADCACTPPS2_LENGTH                        0x1
#define _ADCACTPPS_ADCACTPPS2_MASK                          0x4
#define _ADCACTPPS_ADCACTPPS3_POSN                          0x3
#define _ADCACTPPS_ADCACTPPS3_POSITION                      0x3
#define _ADCACTPPS_ADCACTPPS3_SIZE                          0x1
#define _ADCACTPPS_ADCACTPPS3_LENGTH                        0x1
#define _ADCACTPPS_ADCACTPPS3_MASK                          0x8
#define _ADCACTPPS_ADCACTPPS4_POSN                          0x4
#define _ADCACTPPS_ADCACTPPS4_POSITION                      0x4
#define _ADCACTPPS_ADCACTPPS4_SIZE                          0x1
#define _ADCACTPPS_ADCACTPPS4_LENGTH                        0x1
#define _ADCACTPPS_ADCACTPPS4_MASK                          0x10

// Register: RA0PPS
#define RA0PPS RA0PPS
extern volatile unsigned char           RA0PPS              __at(0xE90);
#ifndef _LIB_BUILD
asm("RA0PPS equ 0E90h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0PPS                 :4;
    };
    struct {
        unsigned RA0PPS0                :1;
        unsigned RA0PPS1                :1;
        unsigned RA0PPS2                :1;
        unsigned RA0PPS3                :1;
    };
} RA0PPSbits_t;
extern volatile RA0PPSbits_t RA0PPSbits __at(0xE90);
// bitfield macros
#define _RA0PPS_RA0PPS_POSN                                 0x0
#define _RA0PPS_RA0PPS_POSITION                             0x0
#define _RA0PPS_RA0PPS_SIZE                                 0x4
#define _RA0PPS_RA0PPS_LENGTH                               0x4
#define _RA0PPS_RA0PPS_MASK                                 0xF
#define _RA0PPS_RA0PPS0_POSN                                0x0
#define _RA0PPS_RA0PPS0_POSITION                            0x0
#define _RA0PPS_RA0PPS0_SIZE                                0x1
#define _RA0PPS_RA0PPS0_LENGTH                              0x1
#define _RA0PPS_RA0PPS0_MASK                                0x1
#define _RA0PPS_RA0PPS1_POSN                                0x1
#define _RA0PPS_RA0PPS1_POSITION                            0x1
#define _RA0PPS_RA0PPS1_SIZE                                0x1
#define _RA0PPS_RA0PPS1_LENGTH                              0x1
#define _RA0PPS_RA0PPS1_MASK                                0x2
#define _RA0PPS_RA0PPS2_POSN                                0x2
#define _RA0PPS_RA0PPS2_POSITION                            0x2
#define _RA0PPS_RA0PPS2_SIZE                                0x1
#define _RA0PPS_RA0PPS2_LENGTH                              0x1
#define _RA0PPS_RA0PPS2_MASK                                0x4
#define _RA0PPS_RA0PPS3_POSN                                0x3
#define _RA0PPS_RA0PPS3_POSITION                            0x3
#define _RA0PPS_RA0PPS3_SIZE                                0x1
#define _RA0PPS_RA0PPS3_LENGTH                              0x1
#define _RA0PPS_RA0PPS3_MASK                                0x8

// Register: RA1PPS
#define RA1PPS RA1PPS
extern volatile unsigned char           RA1PPS              __at(0xE91);
#ifndef _LIB_BUILD
asm("RA1PPS equ 0E91h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA1PPS                 :4;
    };
    struct {
        unsigned RA1PPS0                :1;
        unsigned RA1PPS1                :1;
        unsigned RA1PPS2                :1;
        unsigned RA1PPS3                :1;
    };
} RA1PPSbits_t;
